{
  "channeldata": {
    "activate.d": false,
    "binary_prefix": false,
    "deactivate.d": false,
    "description": null,
    "dev_url": null,
    "doc_source_url": null,
    "doc_url": null,
    "home": "https://github.com/NCAR/Fields",
    "icon_hash": null,
    "icon_url": null,
    "identifiers": null,
    "keywords": null,
    "license": "GPL (>= 2)",
    "post_link": false,
    "pre_link": false,
    "pre_unlink": false,
    "recipe_origin": null,
    "run_exports": {},
    "source_git_url": null,
    "source_url": [
      "https://cran.r-project.org/src/contrib/Archive/fields/fields_9.8-3.tar.gz",
      "https://cran.r-project.org/src/contrib/fields_9.8-3.tar.gz"
    ],
    "subdirs": [
      "win-64"
    ],
    "summary": "For curve, surface and function fitting with an emphasis on splines, spatial data, geostatistics,  and spatial statistics. The major methods include cubic, and thin plate splines, Kriging, and compactly supported covariance functions for large data sets. The splines and Kriging methods are supported by functions that can determine the smoothing parameter (nugget and sill variance) and other covariance function parameters by cross validation and also by restricted maximum likelihood. For Kriging there is an easy to use function that also estimates the correlation scale (range parameter).  A major feature is that any covariance function implemented in R and following a simple format can be used for spatial prediction. There are also many useful functions for plotting and working with spatial data as images. This package also contains an implementation of sparse matrix methods for large spatial data sets and currently requires the sparse matrix (spam) package. Use help(fields) to get started and for an overview.  The fields source code is deliberately commented and provides useful explanations of numerical details as a companion to the manual pages. The commented source code can be viewed by expanding  source code version and looking in the R subdirectory. The reference for fields can be generated by the citation function in R and has DOI <doi:10.5065/D6W957CT>. Development of this package was supported in part by the National Science Foundation  Grant 1417857 and the National Center for Atmospheric Research. See the Fields URL for a vignette on using this package and some background on spatial statistics.",
    "tags": null,
    "text_prefix": false,
    "timestamp": 1563411564,
    "version": "9.8_3"
  },
  "channeldata_version": 1,
  "feedstock": null,
  "labels": [
    "main",
    "cf202003"
  ],
  "package": "r-fields-9.8_3-r36h17ddedb_1.tar.bz2",
  "repodata": {
    "build": "r36h17ddedb_1",
    "build_number": 1,
    "depends": [
      "m2w64-gcc-libs",
      "r-base >=3.6,<3.7.0a0",
      "r-maps",
      "r-spam"
    ],
    "license": "GPL (>= 2)",
    "license_family": "GPL3",
    "md5": "1b4990e031922af2bc05b0d09a07493b",
    "name": "r-fields",
    "sha256": "ba07d2cff7fea1589deb3825d984cce6c1a5e89ad8f7573e22676d7e5e59e7f5",
    "size": 4125889,
    "subdir": "win-64",
    "timestamp": 1563411564838,
    "version": "9.8_3"
  },
  "repodata_version": 1,
  "subdir": "win-64",
  "url": "https://conda.anaconda.org/conda-forge/win-64/r-fields-9.8_3-r36h17ddedb_1.tar.bz2"
}