{
  "channeldata": {
    "activate.d": false,
    "binary_prefix": false,
    "deactivate.d": false,
    "description": null,
    "dev_url": null,
    "doc_source_url": null,
    "doc_url": null,
    "home": "http://www.mixOmics.org",
    "icon_hash": null,
    "icon_url": null,
    "identifiers": null,
    "keywords": null,
    "license": "GPL-2.0-or-later",
    "post_link": false,
    "pre_link": false,
    "pre_unlink": false,
    "recipe_origin": null,
    "run_exports": {},
    "source_git_url": null,
    "source_url": [
      "https://cran.r-project.org/src/contrib/Archive/mixOmics/mixOmics_6.3.2.tar.gz",
      "https://cran.r-project.org/src/contrib/mixOmics_6.3.2.tar.gz"
    ],
    "subdirs": [
      "win-64"
    ],
    "summary": "Multivariate methods are well suited to large omics data sets where the number of variables (e.g. genes, proteins, metabolites) is much larger than the number of samples (patients, cells, mice). They have the appealing properties of reducing the dimension of the data by using instrumental variables (components), which are defined as combinations of all variables. Those components are then used to produce useful graphical outputs that enable better understanding of the relationships and correlation structures between the different data sets that are integrated. mixOmics offers a wide range of multivariate methods for the exploration and integration of biological datasets with a particular focus on variable selection. The package proposes several sparse multivariate models we have developed to identify the key variables that are highly correlated, and/or explain the biological outcome of interest. The data that can be analysed with mixOmics may come from high throughput sequencing technologies, such as omics data (transcriptomics, metabolomics, proteomics, metagenomics etc) but also beyond the realm of omics (e.g. spectral imaging). The methods implemented in mixOmics can also handle missing values without having to delete entire rows with missing data. A non exhaustive list of methods include variants of generalised Canonical Correlation Analysis, sparse Partial Least Squares and sparse Discriminant Analysis. Recently we implemented integrative methods to combine multiple data sets: N-integration with variants of Generalised Canonical Correlation Analysis and P-integration with variants of multi-group Partial Least Squares.",
    "tags": null,
    "text_prefix": false,
    "timestamp": 1600436751,
    "version": "6.3.2"
  },
  "channeldata_version": 1,
  "feedstock": "r-mixomics-feedstock",
  "labels": [
    "main"
  ],
  "package": "r-mixomics-6.3.2-r36h6115d3f_4.tar.bz2",
  "repodata": {
    "build": "r36h6115d3f_4",
    "build_number": 4,
    "depends": [
      "r-base >=3.6,<3.7.0a0",
      "r-corpcor",
      "r-dplyr",
      "r-ellipse",
      "r-ggplot2",
      "r-gridextra",
      "r-igraph",
      "r-lattice",
      "r-mass",
      "r-matrixstats",
      "r-rarpack",
      "r-rcolorbrewer",
      "r-reshape2",
      "r-rgl",
      "r-tidyr"
    ],
    "license": "GPL-2.0-or-later",
    "license_family": "GPL3",
    "md5": "cfa74d2c09c27451805dde51b3985ff0",
    "name": "r-mixomics",
    "sha256": "1131787e5fa5f3fd93bed231e8b39d25c1058062ce40779a39c76991d246b02d",
    "size": 5939597,
    "subdir": "win-64",
    "timestamp": 1600436751859,
    "version": "6.3.2"
  },
  "repodata_version": 1,
  "subdir": "win-64",
  "url": "https://github.com/regro/releases/releases/download/win-64/r-mixomics-6.3.2-r36h6115d3f_4.tar.bz2/r-mixomics-6.3.2-r36h6115d3f_4.tar.bz2"
}