{
  "channeldata": {
    "activate.d": false,
    "binary_prefix": false,
    "deactivate.d": false,
    "description": "The StaticFrame library defines the Series and Frame, immutable data structures for one- and two-dimensional calculations with self-aligning, labelled axes. StaticFrame meets the need for an immutable, Pandas-like DataFrame with a modern and interface. StaticFrame is suitable for applications in data science, data engineering, finance, scientific computing, and related fields where reducing opportunities for error by prohibiting mutation is critical.  While many interfaces are similar to Pandas, StaticFrame deviates from Pandas in many ways: all data is immutable, and all indices are unique; the full range of NumPy data types is preserved, and date-time indices use discrete NumPy types; hierarchical indices are seamlessly integrated; and uniform approaches to element, row, and column iteration and function application are provided. Core StaticFrame depends only on NumPy: Pandas is not a dependency.  A wide variety of table storage and representation formats are supported, including input from and output to CSV, TSV, JSON, Excel XLSX, SQLite, HDF5, NumPy, Pandas, Arrow, and Parquet; additionally, output to xarray, HTML, RST, Markdown, and LaTeX is supported, as well as HTML representations in Jupyter notebooks. The Bus, a container of Frames, permits writing to and lazily reading from multi-table storage formats, including zipped pickles, XLSX workbooks, SQLite, and HDF5.",
    "dev_url": "https://github.com/InvestmentSystems/static-frame",
    "doc_source_url": null,
    "doc_url": "https://static-frame.readthedocs.io",
    "home": "https://github.com/InvestmentSystems/static-frame",
    "icon_hash": null,
    "icon_url": null,
    "identifiers": null,
    "keywords": null,
    "license": "MIT",
    "post_link": false,
    "pre_link": false,
    "pre_unlink": false,
    "recipe_origin": null,
    "run_exports": {},
    "source_git_url": null,
    "source_url": "https://pypi.io/packages/source/s/static-frame/static-frame-0.6.29.tar.gz",
    "subdirs": [
      "noarch"
    ],
    "summary": "Immutable structures for one- and two-dimensional calculations with labelled axis",
    "tags": null,
    "text_prefix": false,
    "timestamp": 1598559861,
    "version": "0.6.29"
  },
  "channeldata_version": 1,
  "feedstock": "static-frame-feedstock",
  "labels": [
    "main"
  ],
  "package": "static-frame-0.6.29-py_0.tar.bz2",
  "repodata": {
    "build": "py_0",
    "build_number": 0,
    "depends": [
      "automap >=0.4.8",
      "numpy >=1.16.5",
      "python >=3.6"
    ],
    "license": "MIT",
    "license_family": "MIT",
    "md5": "5c6436a44697bdc4efa0a16448cf0bad",
    "name": "static-frame",
    "noarch": "python",
    "sha256": "16a1a074f21388a3c4e89a99203172990503eaa43864aa11395f478e2e9e15da",
    "size": 293896,
    "subdir": "noarch",
    "timestamp": 1598559861072,
    "version": "0.6.29"
  },
  "repodata_version": 1,
  "subdir": "noarch",
  "url": "https://github.com/regro/releases/releases/download/noarch/static-frame-0.6.29-py_0.tar.bz2/static-frame-0.6.29-py_0.tar.bz2"
}