{
  "channeldata": {
    "activate.d": false,
    "binary_prefix": true,
    "deactivate.d": false,
    "description": "The Kapteyn Package is a collection of Python modules and applications developed by members of the computer group (*) of the Kapteyn Astronomical Institute, University of Groningen, The Netherlands.  The purpose of the package is to provide tools for the development of astronomical applications with Python.  The package is suitable for both inexperienced and experienced users and developers and documentation is provided for both groups.  The documentation also provides in-depth chapters about celestial transformations and spectral translations.  Some of the package's features:     * The handling of spatial and spectral coordinates, WCS projections      and transformations between different sky systems.  Spectral      translations (e.g., between frequencies and velocities) are supported      and also mixed coordinates.  (Modules wcs and celestial. Module wcs      uses Mark Calabretta's WCSLIB which is distributed with the package.)     * Versatile tools for writing small and dedicated applications for      the inspection of FITS headers, the extraction and display of (FITS)      data, interactive inspection of this data (color editing) and for the      creation of plots with world coordinate information.  (Module maputils)      As one example, a gallery of all-sky plots is provided.     * A class for the efficient reading, writing and manipulating simple      table-like structures in text files.  (Module tabarray)     * Utilities for use with matplotlib such as obtaining coordinate      information from plots, interactively modifiable colormaps and timer      events (module mplutil); tools for parsing and interpreting coordinate      information entered by the user (module positions).     * A function to search for gaussian components in a profile      (module profiles) and a class for non-linear least squares fitting      (module kmpfit).",
    "dev_url": "https://github.com/kapteyn-astro/kapteyn",
    "doc_source_url": null,
    "doc_url": "https://www.astro.rug.nl/software/kapteyn/",
    "home": "https://www.astro.rug.nl/software/kapteyn/",
    "icon_hash": null,
    "icon_url": null,
    "identifiers": null,
    "keywords": null,
    "license": "BSD 3-Clause",
    "post_link": false,
    "pre_link": false,
    "pre_unlink": false,
    "recipe_origin": null,
    "run_exports": {},
    "source_git_url": null,
    "source_url": "https://pypi.io/packages/source/k/kapteyn/kapteyn-2.3.tar.gz",
    "subdirs": [
      "osx-64"
    ],
    "summary": "Astronomical package for spatial and spectral coordinates, WCS projections and transformation, and more...",
    "tags": null,
    "text_prefix": false,
    "timestamp": 0,
    "version": "2.3"
  },
  "channeldata_version": 1,
  "feedstock": null,
  "labels": [
    "main",
    "cf202003",
    "cf201901"
  ],
  "package": "kapteyn-2.3-np113py27_1.tar.bz2",
  "repodata": {
    "build": "np113py27_1",
    "build_number": 1,
    "depends": [
      "numpy 1.13*",
      "python 2.7*",
      "six"
    ],
    "license": "BSD 3-Clause",
    "license_family": "BSD",
    "md5": "a20726f22ead11f6dd6ed1d130307b2f",
    "name": "kapteyn",
    "sha256": "807fb261331d3a608105346e92e90f6aea6a15394d96171d9c92610812083215",
    "size": 1064712,
    "subdir": "osx-64",
    "version": "2.3"
  },
  "repodata_version": 1,
  "subdir": "osx-64",
  "url": "https://conda.anaconda.org/conda-forge/osx-64/kapteyn-2.3-np113py27_1.tar.bz2"
}