{
  "channeldata": {
    "activate.d": false,
    "binary_prefix": false,
    "deactivate.d": false,
    "description": "FiPy is an object oriented, partial differential equation (PDE) solver, written in Python, based on a standard finite volume (FV) approach. The framework has been developed in the Materials Science and Engineering Division (MSED) and Center for Theoretical and Computational Materials Science (CTCMS), in the Material Measurement Laboratory (MML) at the National Institute of Standards and Technology (NIST). The solution of coupled sets of PDEs is ubiquitous to the numerical simulation of science problems. | Numerous PDE solvers exist, using a variety of languages and numerical approaches. Many are proprietary, expensive and difficult to customize. As a result, scientists spend considerable resources repeatedly developing limited tools for specific problems. Our approach, combining the FV method and Python, provides a tool that is extensible, powerful and freely available. A significant advantage to Python is the existing suite of tools for array calculations, sparse matrices and data rendering. | The FiPy framework includes terms for transient diffusion, convection and standard sources, enabling the solution of arbitrary combinations of coupled elliptic, hyperbolic and parabolic PDEs. Currently implemented models include phase field treatments of polycrystalline, dendritic, and electrochemical phase transformations as well as a level set treatment of the electrodeposition process.",
    "dev_url": "https://github.com/usnistgov/fipy",
    "doc_source_url": null,
    "doc_url": "http://www.ctcms.nist.gov/fipy",
    "home": "http://www.ctcms.nist.gov/fipy",
    "icon_hash": null,
    "icon_url": null,
    "identifiers": null,
    "keywords": null,
    "license": "NIST public domain",
    "post_link": false,
    "pre_link": false,
    "pre_unlink": false,
    "recipe_origin": null,
    "run_exports": {},
    "source_git_url": null,
    "source_url": "https://github.com/usnistgov/FiPy/archive/3.3.tar.gz",
    "subdirs": [
      "linux-64"
    ],
    "summary": "A finite volume partial differential equation solver using Python",
    "tags": null,
    "text_prefix": false,
    "timestamp": 1561991332,
    "version": "3.3"
  },
  "channeldata_version": 1,
  "feedstock": null,
  "labels": [
    "broken"
  ],
  "package": "fipy-3.3-py27h5ca1d4c_0.tar.bz2",
  "repodata": {
    "build": "py27h5ca1d4c_0",
    "build_number": 0,
    "depends": [
      "gmsh <4.0",
      "matplotlib <3.0",
      "mayavi",
      "mpi4py",
      "numpy",
      "pysparse",
      "python >=2.7,<2.8.0a0",
      "pytrilinos",
      "scipy"
    ],
    "license": "NIST public domain",
    "md5": "6aa10354390d1e56fa3da2e75aca603a",
    "name": "fipy",
    "sha256": "1fcd0ab663c4cf342655da1caac19e56bb0b9e7bff7b0ba8f4394bc7f4d054c6",
    "size": 535114,
    "subdir": "linux-64",
    "timestamp": 1561991332442,
    "version": "3.3"
  },
  "repodata_version": 1,
  "subdir": "linux-64",
  "url": "https://conda.anaconda.org/conda-forge/label/broken/linux-64/fipy-3.3-py27h5ca1d4c_0.tar.bz2"
}