{
  "channeldata": {
    "activate.d": false,
    "binary_prefix": false,
    "deactivate.d": false,
    "description": null,
    "dev_url": null,
    "doc_source_url": null,
    "doc_url": null,
    "home": "https://CRAN.R-project.org/package=sonicLength",
    "icon_hash": null,
    "icon_url": null,
    "identifiers": null,
    "keywords": null,
    "license": "GPL (>= 2)",
    "post_link": false,
    "pre_link": false,
    "pre_unlink": false,
    "recipe_origin": null,
    "run_exports": {},
    "source_git_url": null,
    "source_url": [
      "https://cran.r-project.org/src/contrib/Archive/sonicLength/sonicLength_1.4.6.tar.gz",
      "https://cran.r-project.org/src/contrib/sonicLength_1.4.6.tar.gz"
    ],
    "subdirs": [
      "noarch"
    ],
    "summary": "Estimate the abundance of cell clones from the distribution of lengths of DNA fragments (as created by sonication, whence `sonicLength').  The algorithm in \"Estimating abundances of retroviral insertion sites from DNA fragment length data\" by Berry CC, Gillet NA, Melamed A, Gormley N, Bangham CR, Bushman FD. Bioinformatics; 2012 Mar 15;28(6):755-62 is implemented.  The experimental setting and estimation details are described in detail there. Briefly, integration of new DNA in a host genome (due to retroviral infection or gene therapy) can be tracked using DNA sequencing, potentially allowing characterization of the abundance of individual cell clones bearing distinct integration sites. The locations of integration sites can be determined by fragmenting the host DNA (via sonication or fragmentase), breaking the newly integrated DNA at a known sequence, amplifying the fragments containing both host and integrated DNA, sequencing those amplicons, then mapping the host sequences to positions on the reference genome. The relative number of fragments containing a given position in the host genome estimates the relative abundance of cells hosting the corresponding integration site, but that number is not available and the count of amplicons per fragment varies widely.  However, the expected number of distinct fragment lengths is a function of the abundance of cells hosting an integration site at a given position and a certain nuisance parameter. The algorithm implicitly estimates that function to estimate the relative abundance.",
    "tags": null,
    "text_prefix": false,
    "timestamp": 1563602982,
    "version": "1.4.6"
  },
  "channeldata_version": 1,
  "feedstock": null,
  "labels": [
    "main",
    "cf202003"
  ],
  "package": "r-soniclength-1.4.6-r35h6115d3f_1.tar.bz2",
  "repodata": {
    "build": "r35h6115d3f_1",
    "build_number": 1,
    "depends": [
      "r-base >=3.5,<3.6.0a0"
    ],
    "license": "GPL (>= 2)",
    "license_family": "GPL3",
    "md5": "c6d00a45238ef562dcdc19af6c138f54",
    "name": "r-soniclength",
    "noarch": "generic",
    "sha256": "e6f14c9adc9e9c04699637720fddcf2a84fa1df6588f8f9db39804f747842a83",
    "size": 308698,
    "subdir": "noarch",
    "timestamp": 1563602982259,
    "version": "1.4.6"
  },
  "repodata_version": 1,
  "subdir": "noarch",
  "url": "https://conda.anaconda.org/conda-forge/noarch/r-soniclength-1.4.6-r35h6115d3f_1.tar.bz2"
}