{
  "channeldata": {
    "activate.d": false,
    "binary_prefix": false,
    "deactivate.d": false,
    "description": "A library of immutable and grow-only Pandas-like DataFrames with a more explicit and consistent interface. StaticFrame is suitable for applications in data science, data engineering, finance, scientific computing, and related fields where reducing opportunities for error by prohibiting in-place mutation is critical.  While many interfaces are similar to Pandas, StaticFrame deviates from Pandas in many ways: all data is immutable, and all indices are unique; the full range of NumPy data types is preserved, and date-time indices use discrete NumPy types; hierarchical indices are seamlessly integrated; and uniform approaches to element, row, and column iteration and function application are provided. Core StaticFrame depends only on NumPy and two C-extension packages (maintained by the StaticFrame team): Pandas is not a dependency.  A wide variety of table storage and representation formats are supported, including input from and output to CSV, TSV, JSON, MessagePack, Excel XLSX, SQLite, HDF5, NumPy, Pandas, Arrow, and Parquet; additionally, output to xarray, HTML, RST, Markdown, and LaTeX is supported, as well as HTML representations in Jupyter notebooks.  StaticFrame features a family of multi-table containers: the Bus is lazily loaded container of tables, the Batch is a deferred processor of tables, and the Quilt is a virtual concatenation of tables. All permit operating on large collections of tables with minimal memory overhead, as well as writing too and reading from zipped bundles of pickles, Parquet, or delimited files, as well as XLSX workbooks, SQLite, and HDF5.",
    "dev_url": "https://github.com/InvestmentSystems/static-frame",
    "doc_source_url": null,
    "doc_url": "https://static-frame.readthedocs.io",
    "home": "https://github.com/InvestmentSystems/static-frame",
    "icon_hash": null,
    "icon_url": null,
    "identifiers": null,
    "keywords": null,
    "license": "MIT",
    "post_link": false,
    "pre_link": false,
    "pre_unlink": false,
    "recipe_origin": null,
    "run_exports": {},
    "source_git_url": null,
    "source_url": "https://pypi.io/packages/source/s/static-frame/static-frame-0.8.30.tar.gz",
    "subdirs": [
      "noarch"
    ],
    "summary": "Immutable structures for one- and two-dimensional calculations with labelled axis",
    "tags": null,
    "text_prefix": false,
    "timestamp": 1638312705,
    "version": "0.8.30"
  },
  "channeldata_version": 1,
  "feedstock": "static-frame-feedstock",
  "labels": [
    "main"
  ],
  "package": "static-frame-0.8.30-pyhd8ed1ab_0.tar.bz2",
  "repodata": {
    "build": "pyhd8ed1ab_0",
    "build_number": 0,
    "depends": [
      "arraykit >=0.1.6",
      "automap >=0.4.8",
      "numpy >=1.17.4",
      "python >=3.6"
    ],
    "license": "MIT",
    "license_family": "MIT",
    "md5": "8a8763af7b0a19f781e7980fc54a2c61",
    "name": "static-frame",
    "noarch": "python",
    "sha256": "6d471fd581cbc2e298e98e24a06ff512451a35f03bfcbd73be1ecaa93c41d67c",
    "size": 426207,
    "subdir": "noarch",
    "timestamp": 1638312705811,
    "version": "0.8.30"
  },
  "repodata_version": 1,
  "subdir": "noarch",
  "url": "https://github.com/conda-forge/releases/releases/download/noarch/static-frame-0.8.30-pyhd8ed1ab_0.tar.bz2/static-frame-0.8.30-pyhd8ed1ab_0.tar.bz2"
}