{
  "channeldata": {
    "activate.d": false,
    "binary_prefix": false,
    "deactivate.d": false,
    "description": "genozip genozip is a compressor for VCF genomic files (it compresses .vcf or .vcf.gz or .vcf.bz2 files).  It achieves x2 to x5 better compression ratios than gzip because it leverages some properties of the genomic data, such as linkage disequilibrium, to compress better. It is also a lot faster than gzip.  The compression is lossless - the decompressed VCF file is 100% identical to the original VCF file.  The command line options are similar to gzip and bcftools, so if you're familiar with these, it works pretty much the same. To get started, try: genozip --help  Commands: genozip   - compress one or more files genounzip - decompress one or more files genols    - show metadata of files or the entire directory genocat   - view one or more files  Some advanced options:  Lookups: genocat -r ^Y,MT file1.vcf       -- displays all chromosomes except Y and MT genocat -r -10000 file1.vcf      -- displays positions up to 10000 genocat -s SMPL1,SMPL2 file1.vcf -- displays 2 samples Note: there is no need for a separate indexing step or index file  Concatenating & splitting: genozip file1.vcf file2.vcf -o concat.vcf.genozip genounzip concat.vcf.genozip -O  Calculating the MD5 of the VCF file: genozip file.vcf --md5 genols file.vcf.genozip --md5 Note: the MD5 is always calculated under the hood in genozip, and automatically verified during genounzip  Encryption: genozip file.vcf --password abc  Feature requests and bug reports: bugs@genozip.com  genozip is free for non-commercial use. For a commercial license, please contact sales@genozip.com  Usage is subject to terms and conditions. The license can be viewed with genozip --license  THIS SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.",
    "dev_url": "https://github.com/divonlan/genozip",
    "doc_source_url": null,
    "doc_url": null,
    "home": "https://github.com/divonlan/genozip",
    "icon_hash": null,
    "icon_url": null,
    "identifiers": null,
    "keywords": null,
    "license": "CUSTOM",
    "post_link": false,
    "pre_link": false,
    "pre_unlink": false,
    "recipe_origin": null,
    "run_exports": {},
    "source_git_url": null,
    "source_url": "https://github.com/divonlan/genozip/archive/genozip-3.0.4.tar.gz",
    "subdirs": [
      "linux-64"
    ],
    "summary": "Compressor for VCF genomic files, up to 5x better than gzip and faster too",
    "tags": null,
    "text_prefix": false,
    "timestamp": 1584499168,
    "version": "3.0.4"
  },
  "channeldata_version": 1,
  "feedstock": null,
  "labels": [
    "cf202003",
    "main"
  ],
  "package": "genozip-3.0.4-h2f06484_0.tar.bz2",
  "repodata": {
    "build": "h2f06484_0",
    "build_number": 0,
    "depends": [
      "bzip2 >=1.0.8,<2.0a0",
      "libgcc-ng >=7.3.0",
      "zlib >=1.2.11,<1.3.0a0"
    ],
    "license": "CUSTOM",
    "license_family": "OTHER",
    "md5": "567a677a0f3d98a0ac074966e57f6ca2",
    "name": "genozip",
    "sha256": "3c39162f1cde387ccb1df2339b9f4f394de487570e297ede0c0e44f3de6fae56",
    "size": 268208,
    "subdir": "linux-64",
    "timestamp": 1584499168870,
    "version": "3.0.4"
  },
  "repodata_version": 1,
  "subdir": "linux-64",
  "url": "https://conda.anaconda.org/conda-forge/linux-64/genozip-3.0.4-h2f06484_0.tar.bz2"
}