{
  "channeldata": {
    "activate.d": false,
    "binary_prefix": false,
    "deactivate.d": false,
    "description": "Genozip  Genozip is also available on Conda and binary downloads. For additional installation options, See: https://genozip.com  Genozip is a compressor for BAM, FASTQ, VCF and other genomic files - see https://genozip.com  For Illumina data .bam and .fastq.gz files, the typical gain over gzip is around 4X. For PacBio and Oxford Nanopore data aligned .bam files, the gain is typically around 2X. For .vcf.gz files, the gain over gzip is typically 3-6X. Here are some examples: https://genozip.com/benchmarks.html.  Yes, Genozip can compress already-compressed files (.gz .bz2 .xz .bam .cram).  The compression is lossless - the decompressed file is 100% identical to the original file (see documentation for exceptions).  Genozip is free for academic and training use (as defined in the license). For use with data generated in a clinical or commercial settings, please see https://genozip.com/commercial.html or contact sales@genozip.com  Usage is subject to terms and conditions. The license can be viewed on https://genozip.com/license.html  THIS SOFTWARE IS PROVIDED \\\"AS IS\\\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT SHALL THE AUTHORS, COPYRIGHT HOLDERS OR DISTRIBUTORS OF THIS SOFTWARE BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.",
    "dev_url": "https://github.com/divonlan/genozip",
    "doc_source_url": null,
    "doc_url": "https://genozip.com",
    "home": "https://genozip.com",
    "icon_hash": null,
    "icon_url": null,
    "identifiers": null,
    "keywords": null,
    "license": "CUSTOM",
    "post_link": false,
    "pre_link": false,
    "pre_unlink": false,
    "recipe_origin": null,
    "run_exports": {},
    "source_git_url": null,
    "source_url": "https://github.com/divonlan/genozip/archive/genozip-13.0.15.tar.gz",
    "subdirs": [
      "osx-64"
    ],
    "summary": "Compressor for genomic files (FASTQ, BAM, VCF, FASTA and more), up to 5x better than gzip and faster too",
    "tags": null,
    "text_prefix": false,
    "timestamp": 1648698192,
    "version": "13.0.15"
  },
  "channeldata_version": 1,
  "feedstock": "genozip-feedstock",
  "labels": [
    "main"
  ],
  "package": "genozip-13.0.15-h0d85af4_0.tar.bz2",
  "repodata": {
    "build": "h0d85af4_0",
    "build_number": 0,
    "depends": [
      "curl"
    ],
    "license": "CUSTOM",
    "license_family": "OTHER",
    "md5": "dc86475e4f9dc732945b8b44dec34d40",
    "name": "genozip",
    "sha256": "86d04096ae7139cee9c82f4c8a7107b7b0ff328202800ff917887159e910cf92",
    "size": 3415576,
    "subdir": "osx-64",
    "timestamp": 1648698192921,
    "version": "13.0.15"
  },
  "repodata_version": 1,
  "subdir": "osx-64",
  "url": "https://github.com/conda-forge/releases/releases/download/osx-64/genozip-13.0.15-h0d85af4_0.tar.bz2/genozip-13.0.15-h0d85af4_0.tar.bz2"
}